Tinor2/DNT-MW-StudyBud/sdkconfig.defaults
# Board: ESP32-S3-LCD-2.8C
# Required for RGB LCD + PSRAM frame buffer

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_DATA_CACHE_LINE_SIZE=64

CONFIG_I2C_SUPPRESS_DEPRECATE_WARN=y

# LVGL Kconfig
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_USE_USER_DATA=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# VSYNC tear avoidance
CONFIG_EXAMPLE_AVOID_TEAR_EFFECT_WITH_SEM=y

# Partition table (use custom partitions.csv with 3MB factory partition)
CONFIG_PARTITION_TABLE_CUSTOM=y
